#pragma once

NS_MFC_Res_BEGIN

	typedef enum
{
	ZL_DATA_SUCCESS =0,
	ZL_DATA_ERROR,
	ZL_DATA_UNINIT,
	ZL_DATA_NULL=0xFF
}ERRORCODE;

class ZOLIX_DLL_MFC_RES CZolixCCD
{

public:
	CZolixCCD();
	~CZolixCCD();
public:
	//***********************************************************************//
	//连接前需先选择号相机类型 InitType
	// Num:10-Andor;15-Mity;20-OTO;25-Greateyes
	// 成功返回0
	//***********************************************************************//
	int InitType(int Num);
	//***********************************************************************//
	//连接相机 Connect
	// 成功返回0
	//***********************************************************************//
	int Connect(); 
	//***********************************************************************//
	// 断开相机连接 DisConnect
	// 成功返回0
	//***********************************************************************//
	int DisConnect();
	//***********************************************************************//
	// 获取相机名称 GetDevName
	// 返回相机名称
	//***********************************************************************//
	CString GetDevName();
	//***********************************************************************//
	// 获取相机X轴Y轴大小 GetDevSize
	//***********************************************************************//
	void GetDevSize(int *xpixSize,int *ypixSize);
	//***********************************************************************//
	// 获取一个像素点尺寸 GetPixSize
	// 单位为 um
	//***********************************************************************//
	void GetPixSize(float *fPix);
	//***********************************************************************//
	// 获取当前设置积分时间 GetExpTime 单位s
	//***********************************************************************//
	void GetExpTime(float *fTime);
	//***********************************************************************//
	// 获取当前相机温度 GetTemper
	// 单位 s
	//***********************************************************************//
	bool GetTemper(int *iTemp);
	//***********************************************************************//
	// 获取当前相机Bin模式范围 GetBinRange
	// *BinMin 最小值 *BinMax  最大值
	//***********************************************************************//
	void GetBinRange(int *BinMin,int *BinMax);
	//***********************************************************************//
	// 设置相机制冷状态 SetCooler
	// iMode：0-关制冷 1-开制冷
	//***********************************************************************//
	void SetCooler(int iMode);
	//***********************************************************************//
	// 设置当前相机Bin模式范围 SetBinRange
	// BinMin 最小值 BinMax  最大值
	//***********************************************************************//
	void SetBinRange(int BinMin,int BinMax);
	//***********************************************************************//
	// 设置相机积分时间 SetExpTime
	// 单位为s
	//***********************************************************************//
	void SetExpTime(float fTime);//积分时间 s
	//***********************************************************************//
	// 获取当前相机温度 SetTemper
	// Andor 最低-60°
	// Mity  最低-40°
	// OTO   无
	// Greateyes 最低-100°
  	//***********************************************************************//
	void SetTemper(int iTemp);
	//***********************************************************************//
	// 显示相机设置窗口 ShowCameraSetDlg
	//***********************************************************************//
	int ShowCameraSetDlg();
	//***********************************************************************//
	// 读取谱图数据 DataAcquisition
	// nPixSize：相机X轴长度
	// void *pd：返回内容
	//***********************************************************************//
	void DataAcquisition(double *pd,int nPixSize);
	//***********************************************************************//
	// 设置语言 SetLanguage
	// nL：0-中文 1-英文
	//***********************************************************************//
	void SetLanguage(int nL);
	//***********************************************************************//
	// 读取X轴数据 XAxisData
	// coeff：校正系数
	// Num：校正系数长度
	// nPixSize:X轴像素长度
	// void *pd：初始化全部为0,返回内容X数据为波长
	//***********************************************************************//
	void XAxisData(double *pd,double *coeff,int Num,int nPixSize);	
	//***********************************************************************//
	// 读取X轴数据 CameraType
	// *strName：返回相机名称
	// *iType：返回相机编码
	// Num:返回不同相机个数
	// strName和iType一一对应
	//***********************************************************************//
	void CameraType(CString *strName,int *iType,int *Num);
	//***********************************************************************//
	// 读取X轴截取数据 GetRangeDataX
	// nNMCM:截取范围是按波长还是波数计算  0-波长 1-波数
	// iSzie:X轴数据长度
	// Laser;激光器波长
	// dRangeLeft:左边范围 单位与nNMCM统一
	// dRangeRight:右边范围 单位与nNMCM统一
	// *inputD：输入X
	// *outputD：输出X
	// *CutF:输出截取后第一个位置 从0开始
	// 返回截取后所有长度
	//***********************************************************************//
	int GetRangeDataX(int nNMCM,int iSzie,double dLaser,double dRangeLeft, double dRangeRight,double *inputD,double *outputD,int *CutF);
	////***********************************************************************//
	// 读取X轴截取数据 GetRangeDataY  该函数与GetRangeDataX连用
	// rSize:截取数据长度
	// *inputD：输入Y
	// *outputD：输出Y
	// CutF:输入截取后第一个位置 从0开始
	////***********************************************************************//
	void GetRangeDataY(int CutF,int rSize,double *inputD,double *outputD);
	////***********************************************************************//
	// 强行中断采集
	////***********************************************************************//
	void TerminateData();
	////***********************************************************************//
	// 设置设备触发模式
	// 相机A: port-0 内触发 1-外触发
	////***********************************************************************//
	void SetExternalPort(int port,HANDLE handle);//设置外触发接口


	void SetPWM(int duty);//设置激光功率
	
	bool getStartOrNot();// lcz new 22/10/24 判断是否打开高级设置
};

NS_MFC_Res_END